{
  "backend/main.mo": "Motoko actor that stores vitals readings (heart rate, BP, SpO2, temperature, respiratory rate) in a list with validation, and exposes methods to add real or simulated readings and query by date range or latest.",
  "feature_evidence.json": "Feature evidence report linking the SuggestionBox feature to its implementation files (Layout.tsx and SuggestionBox.tsx) with test ID and confidence metadata.",
  "frontend-file-summaries.txt": "JSON map of all frontend source files to one-sentence summaries, serving as a reference index for the project's frontend architecture.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark theme color tokens (background, foreground, card, teal accents, status colors).",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Sets up TanStack Router with a root layout route wrapping Dashboard, LogEntry, and History pages inside a React Query provider.",
  "frontend/src/components/Layout.tsx": "App shell with sticky header, desktop/mobile navigation, autonomous monitoring status pill, and persistent SuggestionBox rendered below main page content above the footer.",
  "frontend/src/components/SuggestionBox.tsx": "Persistent bottom bar displaying 12 rotating healthy activity suggestions that auto-advance every 18 seconds with a fade transition and a manual Next button, styled to match the dark teal medical theme.",
  "frontend/src/components/VitalCard.tsx": "Reusable card component displaying a single vital sign with its value, unit, status badge (normal/warning/critical), reference range, and loading skeleton state.",
  "frontend/src/components/VitalsAlertBanner.tsx": "Defines a dismissible alert banner component for individual vitals warnings/criticals, and an AlertsContainer that renders a list of such banners.",
  "frontend/src/components/VitalsTable.tsx": "Renders a sortable table of vitals readings with color-coded status indicators for each vital sign and an overall status column.",
  "frontend/src/components/VitalsTrendChart.tsx": "Renders a Recharts line chart for a single vital sign over time, with optional reference lines for normal range boundaries.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAutonomousMonitor.ts": "Custom hook that automatically submits simulated vitals readings to the backend every 30 seconds and exposes monitor state including countdown and last-recorded time.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching the latest reading, all readings, date-range readings, and a mutation for adding new vitals readings via the backend actor.",
  "frontend/src/index.css": "Global stylesheet defining a medical-grade dark theme with OKLCH CSS variables, Tailwind base/utilities, custom card glow utilities, and font imports.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that displays the latest vitals reading as cards, shows autonomous monitoring status, and manages dismissible alerts for out-of-range vitals.",
  "frontend/src/pages/History.tsx": "History page that displays all vitals readings in a tabbed view with trend charts and a table, supporting optional date-range filtering.",
  "frontend/src/pages/LogEntry.tsx": "Form page for manually entering and submitting a vitals reading, with per-field validation and success/error feedback.",
  "frontend/src/utils/vitalsSimulator.ts": "Generates physiologically plausible simulated vitals readings by drifting values around a baseline with mean-reversion, returning nanosecond-timestamped readings.",
  "frontend/src/utils/vitalsThresholds.ts": "Defines normal/warning/critical thresholds for each vital sign and exports helper functions to evaluate a reading's status and retrieve reference ranges.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom color tokens (teal, navy, status), fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, version, architectural notes, known issues, and a list of existing implemented features for a 24/7 vitals monitoring app."
}