{
  "backend/main.mo": "Motoko actor that stores vitals readings (heart rate, BP, SpO2, temperature, respiratory rate) in a list with input validation, and exposes methods to add real or simulated readings and query them by date range or all at once.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (autonomous vitals monitoring service, dashboard autonomous status UI, and monitoring status pill) to their source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a quick reference for the project's frontend architecture.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, card, status, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Sets up TanStack Router with a root layout route wrapping Dashboard, LogEntry, and History pages, all wrapped in a React Query QueryClientProvider.",
  "frontend/src/components/Layout.tsx": "App shell component with a sticky header, logo, desktop/mobile navigation, and a teal pulsing monitoring status pill; mounts useAutonomousMonitor so the 30-second loop persists across all routes.",
  "frontend/src/components/VitalCard.tsx": "Reusable card component that displays a single vital sign's value, unit, status badge (normal/warning/critical), and clinical reference range, with a loading skeleton state.",
  "frontend/src/components/VitalsAlertBanner.tsx": "Dismissible alert banner component for out-of-range vitals with warning (amber) and critical (red) styles, plus an AlertsContainer that renders a list of such banners.",
  "frontend/src/components/VitalsTable.tsx": "Renders a sortable table of vitals readings with color-coded status indicators (normal/warning/critical) for each metric and an overall status dot per row.",
  "frontend/src/components/VitalsTrendChart.tsx": "Displays a Recharts line chart for a single vital sign over time, with optional reference lines for min/max thresholds and a custom tooltip.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useAutonomousMonitor.ts": "Custom hook that automatically submits simulated vitals readings to the backend every 30 seconds and exposes monitoring state including countdown, last recorded time, and errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching the latest reading, all readings, and date-range-filtered readings, plus a mutation hook for adding new vitals readings.",
  "frontend/src/index.css": "Global stylesheet defining a medical-grade dark theme with OKLCH CSS variables for colors, custom utility classes for card glows and pulse animation, and font imports for Inter and JetBrains Mono.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that displays the latest vitals reading as cards, shows autonomous monitoring status, and manages dismissible alerts for out-of-range vitals.",
  "frontend/src/pages/History.tsx": "History page that displays all past vitals readings in a tabbed view with trend charts and a table, supporting optional date-range filtering.",
  "frontend/src/pages/LogEntry.tsx": "Form page for manually entering and submitting a vitals reading, with per-field validation and success/error feedback.",
  "frontend/src/utils/vitalsSimulator.ts": "Generates physiologically plausible simulated vitals readings by drifting values around a baseline with mean-reversion, returning a timestamped reading object.",
  "frontend/src/utils/vitalsThresholds.ts": "Defines normal/warning/critical thresholds for each vital sign and exports helper functions to evaluate a reading's status and retrieve reference ranges.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom color palettes (teal, navy, status), fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project state, version, architectural notes, known issues, and a list of existing implemented features for a 24/7 vitals monitoring app."
}