{
  "kind": "build_request",
  "title": "Add healthy activity suggestion box to the app footer",
  "projectName": "VitalWatch 24/7",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Create a SuggestionBox component that appears persistently at the bottom of the app (inside the Layout shell, below the main page content). It must display a rotating set of healthy activity suggestions (e.g., 'Take a 10-minute walk', 'Do 5 minutes of deep breathing', 'Drink a glass of water', 'Stand up and stretch'). The suggestions should cycle automatically every 15–20 seconds and also include a 'Next Suggestion' button so the user can advance manually. Style the component to match the existing medical-grade dark theme (dark navy/charcoal background, teal accent text and border, clinical sans-serif font) with a subtle glow consistent with the existing metric cards.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add a suggestion box on the bottom of the app that gives healthy suggestions for what could be one's next healthy activity"
        ]
      },
      "acceptanceCriteria": [
        "A SuggestionBox component is rendered at the bottom of every page via the Layout component.",
        "At least 10 diverse healthy activity suggestions are included (hydration, movement, breathing, posture, rest, etc.).",
        "Suggestions rotate automatically on a 15–20 second interval without user interaction.",
        "A 'Next Suggestion' button allows the user to manually advance to the next suggestion.",
        "The component visually matches the app's dark medical-grade theme with teal accent colors and subtle glow styling.",
        "The suggestion box does not obstruct or overlap page content — it sits below the main content area in the layout flow.",
        "The component is visible and functional on both desktop and mobile screen sizes."
      ]
    }
  ],
  "constraints": [
    "Do not modify any file under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "The suggestion box must be added via the Layout component so it appears on all pages without modifying each page individually.",
    "Suggestions are static/client-side only — no backend changes required."
  ],
  "nonGoals": [
    "Personalizing suggestions based on live vitals data from the backend.",
    "Persisting dismissed or viewed suggestions to the backend.",
    "Adding any new backend methods or data models.",
    "Building a dedicated page or route for suggestions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}