{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Autonomous Continuous Vitals Monitoring — Simulate & Auto-Record Readings In-App",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Implement continuous autonomous vitals monitoring service that simulates realistic sensor readings every 30 seconds and automatically submits them to the backend without user interaction",
      "acceptanceCriteria": [
        "A background service (e.g., custom hook `useAutonomousMonitor`) starts automatically when the app loads and fires every 30 seconds.",
        "Each cycle generates a plausible vitals reading using a realistic simulation algorithm (values within physiological ranges, with slight natural variation each cycle).",
        "Each auto-generated reading is submitted to the backend via the existing mutation hook without any user prompt or button click.",
        "The monitoring loop persists across page navigation (mounted at the root layout level).",
        "A visible 'Monitoring Active' status indicator with a pulsing animation is shown in the app header or dashboard to confirm autonomous monitoring is running."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAutonomousMonitor.ts",
          "operation": "create",
          "description": "Create a custom hook that implements the autonomous vitals monitoring loop. This hook starts a 30-second interval timer on mount, generates realistic simulated vitals readings within physiological ranges (using vitalsThresholds.ts for reference ranges and adding natural variation), and calls the addVitalsReading mutation automatically. The hook returns monitoring state (isActive, lastRecordedTime, nextRecordingIn) for UI display. Must use the existing useAddVitalsReading mutation from useQueries.ts to submit readings."
        },
        {
          "path": "frontend/src/utils/vitalsSimulator.ts",
          "operation": "create",
          "description": "Create a utility module that exports a generateSimulatedReading function. This function produces a complete VitalsReading object with realistic values: heart rate (60-100 bpm), systolic BP (90-140 mmHg), diastolic BP (60-90 mmHg), SpO2 (95-100%), temperature (36.1-37.2°C), respiratory rate (12-20 bpm). Add small random variation (±2-5% per cycle) to simulate natural physiological drift while keeping values within normal ranges defined in vitalsThresholds.ts. Include timestamp generation using Date.now()."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Mount the useAutonomousMonitor hook at the Layout component level to ensure the monitoring loop persists across route changes. Add a teal pulsing status pill (e.g., '● MONITORING' or '● LIVE') to the sticky header that displays the monitoring state. The pill should use the pulse animation utility class from index.css and turn grey/inactive if the monitoring loop errors or is paused. Position the pill in the header beside the logo or navigation."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Update Dashboard page to reflect fully autonomous operation by removing manual log entry CTA and surfacing autonomous monitoring status with last recorded time and next recording countdown",
      "acceptanceCriteria": [
        "Dashboard shows a 'Last recorded' timestamp that updates automatically after each autonomous reading.",
        "A live countdown timer shows seconds until the next automatic recording.",
        "Any CTA that previously prompted the user to manually log a reading is removed or replaced with messaging that monitoring is automatic."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Remove or de-emphasize any manual log entry call-to-action (e.g., button or link prompting user to navigate to /log). Add a prominent 'Autonomous Monitoring Status' section above or beside the vitals cards that displays: (1) 'Last recorded' timestamp pulled from the latest reading or from useAutonomousMonitor state, formatted as a human-readable time-ago string (e.g., '2 seconds ago'), and (2) a live countdown timer showing seconds until the next automatic recording (e.g., 'Next reading in: 28s'). This section should update in real-time using state from the useAutonomousMonitor hook. Retain the existing vitals cards and alert banners without modification."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Update app Layout to add a monitoring status pill visible on all pages, confirming the autonomous loop is active with a pulsing animation",
      "acceptanceCriteria": [
        "A teal pulsing status pill labeled 'MONITORING' or '● LIVE' is present in the sticky header across all pages.",
        "The pill uses the existing pulse animation utility class defined in `frontend/src/index.css`.",
        "The pill turns grey/inactive if the monitoring loop errors out or is paused."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "This operation is covered by REQ-8's Layout.tsx modification. Ensure the teal pulsing status pill is implemented in the sticky header using the pulse animation utility class from index.css. The pill must reflect the monitoring state from useAutonomousMonitor (active = teal pulsing, inactive/error = grey static). No additional file operation is needed here."
        }
      ]
    }
  ]
}