{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add healthy activity suggestion box to the app footer",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Create a SuggestionBox component that displays rotating healthy activity suggestions at the bottom of the app with automatic cycling and manual advance controls",
      "acceptanceCriteria": [
        "A SuggestionBox component is rendered at the bottom of every page via the Layout component.",
        "At least 10 diverse healthy activity suggestions are included (hydration, movement, breathing, posture, rest, etc.).",
        "Suggestions rotate automatically on a 15–20 second interval without user interaction.",
        "A 'Next Suggestion' button allows the user to manually advance to the next suggestion.",
        "The component visually matches the app's dark medical-grade theme with teal accent colors and subtle glow styling.",
        "The suggestion box does not obstruct or overlap page content — it sits below the main content area in the layout flow.",
        "The component is visible and functional on both desktop and mobile screen sizes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SuggestionBox.tsx",
          "operation": "create",
          "description": "Create a SuggestionBox component that displays a rotating set of at least 10 healthy activity suggestions (e.g., 'Take a 10-minute walk', 'Do 5 minutes of deep breathing', 'Drink a glass of water', 'Stand up and stretch', 'Rest your eyes for 30 seconds', 'Practice mindful breathing', 'Take a brief movement break', 'Hydrate with water', 'Check your posture', 'Do gentle shoulder rolls'). The component must cycle suggestions automatically every 15–20 seconds using a setInterval hook, and include a 'Next Suggestion' button to manually advance. Style it with a dark navy/charcoal background, teal accent text and border, clinical sans-serif font (Inter), and a subtle glow effect matching the VitalCard component's card-glow utility class. Ensure the component is responsive and does not overlap page content."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Import and render the SuggestionBox component at the bottom of the Layout component, below the main content outlet but still within the app shell. Position it so it appears persistently across all pages without obstructing the main content. Ensure the layout flow accommodates the suggestion box on both desktop and mobile viewports."
        }
      ]
    }
  ]
}